NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/ZGM23/ZGM230SB27HNN.svd
        <register>
          <name>CH0CFG</name>
          <description>No Description</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <resetMask>0x00015B75</resetMask>
          <fields>
            <field>
              <name>CONVMODE</name>
              <description>Channel 0 Conversion Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>DAC channel 0 is set in continuous mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLEOFF</name>
                  <description>DAC channel 0 is set in sample/shut off mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POWERMODE</name>
              <description>Channel 0 Power Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGHPOWER</name>
                  <description>Default is High Power Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWPOWER</name>
                  <description>Set this bit for Low Power Mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGMODE</name>
              <description>Channel 0 Trigger Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Conversion Trigger Source Selected for Channel 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW</name>
                  <description>Channel 0 is triggered by Channel 0 FIFO (CH0F) write</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCPRS</name>
                  <description>Channel 0 is triggered by Sync PRS input. PRS Trigger should have the same clock group as VDAC.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LESENSE</name>
                  <description>Channel 0 is triggered by LESENSE</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERNALTIMER</name>
                  <description>Channel 0 is triggered by Internal Timer Overflow</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCPRS</name>
                  <description>Channel 0 is triggered by Async PRS input</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFRESHSOURCE</name>
              <description>Channel 0 Refresh Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Refresh Source Selected for Channel 0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFRESHTIMER</name>
                  <description>Channel 0 Refresh triggered by Refresh Timer Overflow</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCPRS</name>
                  <description>Channel 0 Refresh triggered by Sync PRS. PRS Trigger should have the same clock group as VDAC.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCPRS</name>
                  <description>Channel 0 Refresh triggered by Async PRS</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFODVL</name>
              <description>Channel 0 FIFO Low Watermark</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIGHCAPLOADEN</name>
              <description>Channel 0 High Cap Load Mode Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEEPWARM</name>
              <description>Channel 0 Keepwarm Mode Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1CFG</name>
          <description>No Description</description>
          <addressOffset>0x018</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <resetMask>0x00015B75</resetMask>
          <fields>
            <field>
              <name>CONVMODE</name>
              <description>Channel 1 Conversion Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>DAC channel 1 is set in continuous mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLEOFF</name>
                  <description>DAC channel 1 is set in sample/shut off mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POWERMODE</name>
              <description>Channel 1 Power Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGHPOWER</name>
                  <description>Default is High Power Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOWPOWER</name>
                  <description>Set this bit for Low Power Mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGMODE</name>
              <description>Channel 1 Trigger Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Conversion Trigger Source Selected for Channel 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW</name>
                  <description>Channel 1 is triggered by Channel 1 FIFO (CH1F) write</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCPRS</name>
                  <description>Channel 1 is triggered by Sync PRS input.PRS Trigger should have the same clock group as VDAC.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERNALTIMER</name>
                  <description>Channel 1 is triggered by Internal Timer Overflow</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCPRS</name>
                  <description>Channel 1 is triggered by Async PRS input</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFRESHSOURCE</name>
              <description>Channel 1 Refresh Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No Refresh Source Selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFRESHTIMER</name>
                  <description>CH1 Refresh Triggered by Refresh Timer Overflow</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCPRS</name>
                  <description>CH1 Refresh Triggered by Sync PRS. PRS Trigger should have the same clock group as VDAC.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYNCPRS</name>
                  <description>CH1 Refresh Triggered by Async PRS</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFODVL</name>
              <description>Channel 1 FIFO Low Watermark</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HIGHCAPLOADEN</name>
              <description>Channel 1 High Cap Load Mode Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEEPWARM</name>
              <description>Channel 1 Keepwarm Mode Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>No Description</description>
          <addressOffset>0x01C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000F33</resetMask>
          <fields>
            <field>
              <name>CH0EN</name>
              <description>DAC Channel 0 Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH0DIS</name>
              <description>DAC Channel 0 Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1EN</name>
              <description>DAC Channel 1 Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1DIS</name>
              <description>DAC Channel 1 Disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH0FIFOFLUSH</name>
              <description>CH0 WFIFO Flush</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CH1FIFOFLUSH</name>
              <description>CH1 WFIFO Flush</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SINEMODESTART</name>
              <description>Start Sine Wave Generation</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SINEMODESTOP</name>
              <description>Stop Sine Wave Generation</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>No Description</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x04340333</resetMask>
          <fields>
            <field>
              <name>CH0CD</name>
              <description>CH0 Conversion Done Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CD</name>
              <description>CH1 Conversion Done Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0OF</name>
              <description>CH0 Data Overflow Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1OF</name>
              <description>CH1 Data Overflow Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0UF</name>
              <description>CH0 Data Underflow Interrupt Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1UF</name>
              <description>CH1 Data Underflow Interrupt Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ABUSALLOCERR</name>
              <description>ABUS Port Allocation Error Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0DVL</name>
              <description>CH0 Data Valid Level Interrupt Flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1DVL</name>
              <description>CH1 Data Valid Level Interrupt Flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ABUSINPUTCONFLICT</name>
              <description>ABUS Input Conflict Error Flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>No Description</description>
          <addressOffset>0x024</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x04340333</resetMask>
          <fields>
            <field>
              <name>CH0CD</name>
              <description>CH0 Conversion Done Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1CD</name>
              <description>CH1 Conversion Done Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0OF</name>
              <description>CH0 Data Overflow Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1OF</name>
              <description>CH1 Data Overflow Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0UF</name>
              <description>CH0 Data Underflow Interrupt Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1UF</name>
              <description>CH1 Data Underflow Interrupt Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ABUSALLOCERR</name>
              <description>ABUS Allocation Error Interrupt Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0DVL</name>
              <description>CH0 Data Valid Level Interrupt Flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1DVL</name>
              <description>CH1 Data Valid Level Interrupt Flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ABUSINPUTCONFLICT</name>
              <description>ABUS Input Conflict Interrupt Flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0F</name>
          <description>No Description</description>
          <addressOffset>0x028</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Channel 0 Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1F</name>
          <description>No Description</description>
          <addressOffset>0x02C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Channel 1 Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
